In [1]:
import pandas as pd

In [24]:
df = pd.DataFrame(
    {"a" : [4,5,6],
    "b" : [7,8,9],
    "c" : [10,11,12]},
    index=[1,2,3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [22]:
df2 = pd.DataFrame(
    {"a" : [4,5,6],
    "b" : [7,8,9],
    "c" : [10,11,12]},
   )

In [25]:
df2 # index 지정 안하면 0부터 지정됨

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [18]:
df.loc[[1,2], ["a","b"]]

   a  b
1  4  7
2  5  8

### columns name --> dict로 지정할 수도 있고 위처럼 columns라는 인자를 넣을 수도 있다.

In [33]:
df = pd.DataFrame(
    [[4, 7, 10],
    [5, 8, 11],
    [6, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

In [34]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

### multi index를 사용하여 상위 인덱스를 만들 수도 있음
index를 튜블로 지정하여 multi index 지정할 수 있음

In [21]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d',1),('d',2),('e',2)],
    names=['n','v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

## 비교 연산자를 이용해 slicing

In [28]:
df[df.a < 7]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [29]:
df.b > 7

1    False
2     True
3     True
Name: b, dtype: bool

In [31]:
df[df.b > 7]

   a  b   c
2  5  8  11
3  6  9  12

In [38]:
df[df['c'] >= 6]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [48]:
df = pd.DataFrame(
    [[4, 7, 10],
    [6,9,12],
    [6, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

In [49]:
df

   a  b   c
1  4  7  10
2  6  9  12
3  6  9  12

In [50]:
df.drop_duplicates() # 중복된 값을 제거

   a  b   c
1  4  7  10
2  6  9  12

In [51]:
df

   a  b   c
1  4  7  10
2  6  9  12
3  6  9  12

In [54]:
df.drop_duplicates(inplace=True) # 권장하지 않음. 원래 데이터프레임을 수정하니까

In [53]:
df

   a  b   c
1  4  7  10
2  6  9  12

In [117]:
import numpy as np

df = pd.DataFrame(
    [[4, 7, 10, np.nan],
    [5,7,np.nan,11],
    [6,np.nan, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c','d'])

In [80]:
df

   a    b     c     d
1  4  7.0  10.0   NaN
2  5  8.0   NaN  11.0
3  6  NaN   9.0  12.0

In [67]:
df["a"] != 7

1    True
2    True
3    True
Name: a, dtype: bool

In [73]:
df.a.isin([5])  # 해당 column에 해당 값이 있는지 찾는 것 -- 리스트 형태로 넣어야 한다.

1    False
2     True
3    False
Name: a, dtype: bool

In [75]:
df['a'].isin([5]) # column명에 한글, 특수문자 있는 경우 이렇게도 가능

1    False
2     True
3    False
Name: a, dtype: bool

In [81]:
pd.isnull(df) # null 값을 가진 부분은 True로 나옴

       a      b      c      d
1  False  False  False   True
2  False  False   True  False
3  False   True  False  False

In [86]:
df['a'].isnull().sum() # null 값의 총 갯수

0

In [96]:
pd.notnull(df)
~df.notnull()

       a      b      c      d
1  False  False  False   True
2  False  False   True  False
3  False   True  False  False

In [97]:
df.notnull()

      a      b      c      d
1  True   True   True  False
2  True   True  False   True
3  True  False   True   True

> &,|,~,^,df.any(),df.all()  
> Logical and, or, not, xor, any, all

In [94]:
df.all()

a    True
b    True
c    True
d    True
dtype: bool

In [118]:
df[df.b == 7]

   a    b     c     d
1  4  7.0  10.0   NaN
2  5  7.0   NaN  11.0

In [119]:
df[df.a == 5]

   a    b   c     d
2  5  7.0 NaN  11.0